Mronion-dev/ESP-DWD/ESP32_rev2/src/main.cpp
//Second revision of the drone code
// second rev includes new captive portal to bypass hardcoded ssid an password
// Method:
// Esp32 --- New wifi ap with ssid "DWD-{last 4 chars of mac address}" and hardcoded password --- user connects and configures router ssid and password --- remove ap and store ssid and password permanently
// --- connect to ssid and password --- look for drone servers with udp discovery --- connect --- get inputs and outputs
// New features include: 
// -captive portal for changable wifi ssids and passwords
// -resetable ssid and password for reconfig
// -better display
// -more accurate stablization
// for devs: good luck reading this, youll need it

#include <WiFi.h>
#include <ArduinoWebsockets.h>
#include <HTTPClient.h>
#include <WebServer.h>
#include <Wire.h>
#include <SPI.h>
#include <ICM_20948.h>
#include <MadgwickAHRS.h>
#include <MD_MAX72xx.h> //!!FOR DEBUGGING PURPOSES ONLY, NOT REQUIRED!!
#include <ESP32Servo.h>
#include <WiFiUdp.h>
#include <Preferences.h>

Servo servoLeft;
Servo servoRight;
int ServoLeftVal;
int ServoRightVal;

Servo escLeft;
Servo escRight;

ICM_20948_I2C imu;
Madgwick filter;

#define HARDWARE_TYPE MD_MAX72XX::FC16_HW
#define MAX_DEVICES 1
#define CS_PIN 5
MD_MAX72XX matrix = MD_MAX72XX(HARDWARE_TYPE, CS_PIN, MAX_DEVICES);

uint32_t lastTime = 0;
float gxr;
float gyr;
float gzr;


float servoOffset;    
int leftAngle;
int rightAngle;

float leftX;
float leftY;
float rightX;
int rightY;

Preferences preferences;

using namespace websockets;
WebsocketsClient client;

WiFiUDP udp;

const uint16_t DISCOVERY_PORT = 42100;

const uint16_t Port = 54732; // Port that the godot server uses
bool connected = false;

WebServer HTTPserver(80);

void save(String SSID, String PASS, bool OK) {
    preferences.begin("wifi", false);

    preferences.putString("SSID", SSID);
    preferences.putString("PASS", PASS);
    preferences.putBool("OK", OK);

    preferences.end();
}

bool Ok = true;

void handleSend() {
    if (HTTPserver.hasArg("str1") && HTTPserver.hasArg("str2")) {
        String message = HTTPserver.arg("str1");
        String message2 = HTTPserver.arg("str2");

        Serial.print("Received SSID: ");
        Serial.println(message);
        Serial.print("Recieved Password:");
        Serial.println(message2);
        save(message,message2,true);

        HTTPserver.send(200, "text/plain", "Received: " + message);
        Ok = false;
    } else {
        HTTPserver.send(400, "text/plain", "Missing msg parameter");
        save("","",false);
        Ok = true;
    }
}

void setup_AP() {
    // Identifier
    String mac = WiFi.macAddress();

    String last4 = mac.substring(mac.length() - 5);
    last4.replace(":", "");
    // Start Wi-Fi access point
    WiFi.softAP(("Hobby Drone" + last4).c_str(), "12345678");

    Serial.println("AP started");
    Serial.print("IP address: ");
    Serial.println(WiFi.softAPIP());

    // HTTP endpoint
    HTTPserver.on("/send", handleSend);

    HTTPserver.begin();

    Serial.println("HTTP server started");
}

//I2C com with IMU board
void setup_IMU(){
    servoLeft.attach(27);
    servoRight.attach(14);
    servoLeft.write(90);
    servoRight.write(90);

    escLeft.attach(25);
    escRight.attach(26);

    escLeft.writeMicroseconds(1000);
    escRight.writeMicroseconds(1000);
    delay(5000);

    Wire.begin(21, 22);

    bool initialized = false;
    while (!initialized)
    {
        imu.begin(Wire, false);

        Serial.print("Initialization status: ");
        Serial.println(imu.statusString());

        if (imu.status == ICM_20948_Stat_Ok)
        {
            initialized = true;
        }
    }

    Serial.println("IMU connected!");
}

IPAddress discoverServer(uint32_t timeout = 3000)
{
    udp.begin(DISCOVERY_PORT);

    udp.beginPacket("255.255.255.255", DISCOVERY_PORT);
    udp.print("FIND_MY_SERVER");
    udp.endPacket();

    uint32_t start = millis();

    while (millis() - start < timeout)
    {
        int len = udp.parsePacket();

        if (len)
        {
            char buffer[32];
            len = udp.read(buffer, sizeof(buffer) - 1);
            buffer[len] = '\0';

            if (strcmp(buffer, "IM_HERE") == 0)
            {
                return udp.remoteIP();
            }
        }

        delay(10);
    }

    return IPAddress(0,0,0,0);
}


bool connect_to_server()
{

    if (client.connect(discoverServer().toString(), Port, "/"))
    {
        Serial.println("WebSocket connected!");
        return true;
    }

    Serial.println("WebSocket connection failed!");
    return false;
}

void Draw_Check(){
  matrix.setPoint(1,5,true);
  matrix.setPoint(2,6,true);
  matrix.setPoint(3,7,true);
  matrix.setPoint(4,6,true);
  matrix.setPoint(5,5,true);
  matrix.setPoint(6,4,true);
  matrix.setPoint(7,3,true);
}

void flashX(uint8_t flashes = 6, uint16_t onTime = 200, uint16_t offTime = 200)
{
    const uint8_t X[8] =
    {
        B10000001,
        B01000010,
        B00100100,
        B00011000,
        B00011000,
        B00100100,
        B01000010,
        B10000001
    };

    for (uint8_t i = 0; i < flashes; i++)
    {
        // Draw X
        for (uint8_t row = 0; row < 8; row++)
        {
            matrix.setRow(row, X[row]);
        }

        delay(onTime);

        // Clear display
        matrix.clear();

        delay(offTime);
    }
}

bool parseControllerInput(const String& input, float &leftX, float &leftY, float &rightX, int &rightY)
{
    if (input.length() < 12)
        return false;

    leftX  = input.substring(0, 3).toFloat();
    leftY  = input.substring(3, 6).toFloat();
    rightX = input.substring(6, 9).toFloat();
    rightY = input.substring(9, 13).toInt();

    return true;
}

float throttle = 1000.0f; // ESC pulse width in µs

float delta;

float biasX = 0;
float biasY = 0;
float biasZ = 0;

void Stabalize(float roll, float pitch)
{
  float error = leftX * 60 - roll;

  int Kp = 10;
  int Kd = 0;

  float correction = Kp * error - Kd * (imu.gyrX() - biasX);
  
  updateThrottle((int)round(rightY - correction), (int)round(rightY + correction));
}

void updateThrottle(int right, int left)
{
    escLeft.writeMicroseconds(constrain(left, 1000, 2000));
    escRight.writeMicroseconds(constrain(right, 1000, 2000));
}


void calibrateGyro() //creates a bias to subtract from the imu values, reduce shaking and drifings
{
    const int samples = 1000;

    for (int i = 0; i < samples; i++)
    {
        while (!imu.dataReady());

        imu.getAGMT();

        biasX += imu.gyrX();
        biasY += imu.gyrY();
        biasZ += imu.gyrZ();

        delay(2);
    }

    biasX /= samples;
    biasY /= samples;
    biasZ /= samples;
}

void print(String serial){
  if(!Serial){
    return;
  }
  Serial.print(serial);
}

void println(String serialln){
  if(!Serial){
    return;
  }
  Serial.println(serialln);
}

//This runs when the ESP32 boots

void setup() {
    SPI.begin(18, 19, 23, 5);

    matrix.begin();
    matrix.control(MD_MAX72XX::INTENSITY, 5);
    matrix.clear();

    Serial.begin(115200);

    preferences.begin("wifi", true);

    String ssid = preferences.getString("SSID", "");
    String password = preferences.getString("PASS", "");
    bool ok = preferences.getBool("OK", false);

    preferences.end();

    if (!ok) {
        setup_AP();

        while (Ok) {
            HTTPserver.handleClient();
        }

        println("Eat input");
        ESP.restart();
    }

    WiFi.begin(ssid.c_str(), password.c_str());

  uint32_t lastAnimation = 0;
  int i;
  int wait_count = 0;
  while (WiFi.status() != WL_CONNECTED)
  {
    if (millis() - lastAnimation >= 50
    )
    {
      lastAnimation = millis();
      matrix.setPoint(i, 0,true);
      i += 1;
      wait_count += 1;

      // advance animation by ONE step
    }
    if(i == 7){
      matrix.clear();
      i = 0;
    }
    if(wait_count > 100) {
      Serial.println("Wifi failed, restarting...");
      ESP.restart();
    }
  }
  pinMode(15, INPUT_PULLUP);
  matrix.clear();
  Draw_Check();
  delay(100);
  println("Connected to Wi-Fi");
  print("IP Address: ");
  println(WiFi.localIP());
  print("Gateway (Router IP): ");
  println(WiFi.gatewayIP()); // Get router's IP address
  
  //Connect to the Websocket safely and handle timeouts
  if(connect_to_server() == false){
    connected = false;
    println("connection failed, stopping and reseting esp...");
    ESP.restart();
  }
  else{
    connected = true;
  }

  setup_IMU();
  println("IMU connected succesfully");
  calibrateGyro();
  println("IMU calibrated!");
  filter.begin(100.0f);
  
  client.onMessage([](WebsocketsMessage msg) {
    String input = String(msg.data());

    if(input == "closing") {
      println("Server is off, pleas restart the esp32 to reconnect");
      while(true) {
        flashX();
      }
    }

    if(input == "rest") {
      println("requested restart");
      flashX(4,50,50);
      ESP.restart();
    }

    if(input == "RESET") {
      println("requested factory defaults");
      flashX(5,200,50);
      save("","",false);
      ESP.restart();
    }

    if(parseControllerInput(input, leftX, leftY, rightX , rightY) == true){

      leftAngle  = constrain(leftAngle, 70, 110);
      rightAngle = constrain(rightAngle, 70, 110);

      updateThrottle(rightY + (int)(servoOffset) * 5 + (int)((leftY - 1.0f) * 10.0f), (int)((leftX - 1.0f) * 20.0f));

      servoLeft.write(leftAngle);
      servoRight.write(rightAngle);
    }
      
  });
}


int t = 0;
int angle = 0;

void loop() {
  if(connected == false) {
    return;
  }

  if(digitalRead(15) == LOW){
    Serial.println("reseting physically");
    save("","",false);
    ESP.restart();
  }

  uint32_t now = micros();
  delta = (now - lastTime) / 1000000.0f; //delta is saved as seconds 
  lastTime = now;

  client.poll();

  if (imu.dataReady())
  {
    imu.getAGMT();

    float gx = imu.gyrX() - biasX;
    float gy = imu.gyrY() - biasY;
    float gz = imu.gyrZ() - biasZ;

    float ax = imu.accX() / 1000.0f;
    float ay = imu.accY() / 1000.0f;
    float az = imu.accZ() / 1000.0f;

    filter.updateIMU(
      gx, gy, gz,
      ax, ay, az
    );

    float qw = filter.q0;
    float qx = filter.q1;
    float qy = filter.q2;
    float qz = filter.q3;

    client.send(String(qw, 3) + " " + String(qx, 3) + " " + String(qy, 3) + " " + String(qz, 3));
    if(delta < 0.00000001f) {
      delayMicroseconds(10000 - (int)(delta * 1000000.0f));
    }

    Stabalize(filter.roll, filter.pitch);
  }
}